// Написати систему контролю банку.

// Властивості:
// - список користувачів [userId, FIO,'password']
// - список рахунків [userId, accountNumber, value]

// Методи:
// - додати користувача
// - видалити користувача

// - створити рахунок
// - видалити рахунок

// - додати гроші на рахунок
// - зняти гроші з рахунка
// ```

// ---

// Менеджер завдань: Створіть функцію яка створює та повертає обьект завдання.
// Об'єкт task, який буде містити властивості Name, deadline, priority та done.
// Додайте методи для відмітки завдання як виконаного та для виведення
// інформаціїпро завдання.

// ---

// Каталог товарів: Створіть каталог товарів, де кожен товар буде об'єктом з
// властивостями назва, ціна та кількість. Додайте методи для додавання товару,
// видалення товару та підрахунку загальної вартості.

// const itemList = {
//     items:[], 
//     addItem(item){
// this.items.push(item)
//     },
// removeItem(itemName){
//     this.items = this.items.filter(item => item.name !==itemName);
// },

// }

// itemList.addItem({name:"Beef", price:25, count: 100});
// itemList.addItem({name:"eggs", price:22, count: 100});
// itemList.addItem({name:"cocolate", price:20, count: 100});

// console.log(itemList.items);

// itemList.removeItem("eggs");
// console.log(itemList.items);

// ---

// Система реєстрації: Створіть систему реєстрації користувачів, де кожен
// користувач буде об'єктом з властивостями ім'я, email, пароль тощо. Додайте метод
// для перевірки введеного пароля при вході.

// ---

// Онлайн-книга: Створіть програму для ведення списку прочитаних книг. Кожна книга
// буде об'єктом з властивостями назва, автор, рік видання та прочитано
// (true/false). Додайте методи для відмітки книги як прочитаної та виведення
// статистики про прочитані книги.

// ---

// Ігровий персонаж: Створіть об'єкт, який представляє ігрового персонажа. Додайте
// властивості, такі як ім'я, рівень, здоров'я, атака тощо. Реалізуйте методи для
// атаки інших персонажів та відновлення здоров'я.

// ---

// Список контактів: Створіть програму для управління списком контактів. Кожен
// контакт буде об'єктом з властивостями ім'я, телефон, email тощо. Додайте методи
// для додавання, видалення та пошуку контактів.

// ---

// Календар подій: Створіть календар подій, де кожна подія буде об'єктом з
// властивостями назва, дата, місце та повідомлення. Додайте методи для додавання
// події, видалення події та перегляду подій на певну дату.

// ---

// Онлайн-магазин: Створіть онлайн-магазин з можливістю додавання товарів у кошик
// та оформлення замовлення. Кожен товар буде об'єктом з властивостями назва, ціна,
// наявність тощо. Реалізуйте методи для додавання товару у кошик, підрахунку
// загальної вартості та оформлення замовлення.

// ---

// Пошук інформації: Створіть програму, яка дозволить шукати інформацію в тексті.
// Ви створюєте об'єкт зі збереженими текстовими даними та методами для пошуку
// заданого слова або фрази у тексті.

// ---

// Банківський рахунок: Створіть об'єкт account, який міститиме інформацію про
// банківський рахунок користувача, таку як ім'я, баланс та історія транзакцій.
// Додайте методи для додавання та витрати коштів, а також для виведення історії
// транзакцій.

// ---

// ## Example 1 - Масив об'єктів

// Напишіть ф-цію `calcTotalPrice(stones, stoneName)`, яка приймає масив об'єктів
// та рядок з назвою каменю. Ф-ція вважає та повертає загальну вартість каміння з
// таким ім'ям, ціною та кількістю з об'єкта

// ### Код

// ```js
// const stones = [
//   { name: 'Смарагд', price: 1300, quantity: 4 },
//   { name: 'Діамант', price: 2700, quantity: 3 },
//   { name: 'Сапфір', price: 400, quantity: 7 },
//   { name: 'Щебінь', price: 200, quantity: 2 },
// ];
// ```

// ## Example 2 - Комплексні завдання

// Напиши скрипт управління особистим кабінетом інтернет-банку. Є об'єкт `account`
// в якому необхідно реалізувати методи для роботи з балансом та історією
// транзакцій.

// ```js
// /*
//  * Типів транзацький лише два.
//  * Можна покласти чи зняти гроші з рахунку.
//  */
// const Transaction = {
//   DEPOSIT: 'deposit',
//   WITHDRAW: 'withdraw',
// };

// /*
//  * Кожна транзакція це об'єкт із властивостями: id, type та amount
//  */

// const account = {
//   // Поточний баланс рахунку
//   balance: 0,

//   // Історія транзакцій
//   transactions: [],

//   /*
//    * Метод створює та повертає об'єкт транзакції.
//    * Приймає суму та тип транзакції.
//    */
//   createTransaction(amount, type) {},

//   /*
//    * Метод, що відповідає за додавання суми до балансу.
//    * Приймає суму танзакції.
//    * Викликає createTransaction для створення об'єкта транзакції
//    * після чого додає його в історію транзакцій
//    */
//   deposit(amount) {},

//   /*
//    * Метод, що відповідає за зняття суми з балансу.
//    * Приймає суму танзакції.
//    * Викликає createTransaction для створення об'єкта транзакції
//    * Після чого додає його в історію транзакцій.
//    *
//    * Якщо amount більше ніж поточний баланс, виводь повідомлення
//    * про те, що зняття такої суми не можливе, недостатньо коштів.
//    */
//   withdraw(amount) {},

//   /*
//    * Метод повертає поточний баланс
//    */
//   getBalance() {},

//   /*
//    * Метод шукає та повертає об'єкт транзації по id
//    */
//   getTransactionDetails(id) {},

//   /*
//    * Метод повертає кількість коштів
//    * певного типу транзакції з усієї історії транзакцій
//    */
//   getTransactionTotal(type) {},
// };
// ```

















// Задача 1: Створення об'єкта "Користувач"
// Створіть об'єкт user з такими властивостями:
// name (ім'я користувача, рядок),
// age (вік користувача, число),
// address (адреса користувача, рядок).


// const user = {
//     name: "David",
//     age:33,
//     address: "Kyiv",
//     showName(){
//         console.log(user.name)
//     },
//     setName(string){
//         this.name = string
//     },
//     showInfo(){
//          const masseg = `Ім'я: ${user.name}, Вік: ${user.age}, Адреса: ${user.address}`
//         console.log(masseg)
//     },
//     isAdult(){
//       return user.age >= 18
//     },
//     updateAge(number){
// user.age += number
//     },
// }



// const user2  = {
//     name: "David",
//     age:33,
//     address: "Kyiv",
//     showName(){
//         console.log(user.name)
//     },
//     setName(string){
//         this.name = string
//     },
//     showInfo(){
//          const masseg = `Ім'я: ${user.name}, Вік: ${user.age}, Адреса: ${user.address}`
//         console.log(masseg)
//     },
//     isAdult(){
//       return user.age >= 18
//     },
//     updateAge(number){
// user.age += number
//     },
// }
// user.showName();
// user.setName("Max");
// user.showName();
// user.showInfo();
// user.updateAge(5);
// console.log(user);
// console.log(user.isAdult());

// Задача 2: Метод для відображення імені
// Додайте до об'єкта user метод showName, який:
// Виводить у консоль значення властивості name.

// Задача 3: Метод для зміни імені
// Додайте до об'єкта user метод setName, який:
// Приймає нове ім'я (рядок) як аргумент.
// Оновлює значення властивості name на нове.

// Задача 4: Метод для повної інформації
// Додайте до об'єкта user метод showInfo, який:

// Виводить повідомлення у форматі:
// "Ім'я: [name], Вік: [age], Адреса: [address]".


// Задача 5: Метод для перевірки віку
// Додайте до об'єкта user метод isAdult, який:
// Повертає true, якщо користувач старший або дорівнює 18 років, інакше — false.

// Задача 6: Оновлення віку
// Додайте до об'єкта user метод updateAge, який:

// Приймає число як аргумент.
// Збільшує значення властивості age на передане число.
// Задача 7: Зміна адреси
// Додайте до об'єкта user метод changeAddress, який:

// Приймає нову адресу (рядок) як аргумент.
// Оновлює значення властивості address.
// Задача 8: Перевірка вікової категорії
// Додайте до об'єкта user метод getCategory, який:

// Повертає одну з категорій залежно від віку:
// "дитина", якщо вік менший за 13 років,
// "підліток", якщо вік від 13 до 17 років,
// "дорослий", якщо вік 18 років або старший.
// Задача 9: Повне очищення даних
// Додайте до об'єкта user метод resetInfo, який:

// Скидає значення всіх властивостей (name, age, address) на пусті значення:
// name → пустий рядок,
// age → 0,
// address → пустий рядок.Задача 1: Створення об'єкта "Користувач"
// Створіть об'єкт user з такими властивостями:
// name (ім'я користувача, рядок),
// age (вік користувача, число),
// address (адреса користувача, рядок).
// Задача 2: Метод для відображення імені
// Додайте до об'єкта user метод showName, який:

// Виводить у консоль значення властивості name.
// Задача 3: Метод для зміни імені
// Додайте до об'єкта user метод setName, який:

// Приймає нове ім'я (рядок) як аргумент.
// Оновлює значення властивості name на нове.
// Задача 4: Метод для повної інформації
// Додайте до об'єкта user метод showInfo, який:

// Виводить повідомлення у форматі:
// "Ім'я: [name], Вік: [age], Адреса: [address]".
// Задача 5: Метод для перевірки віку
// Додайте до об'єкта user метод isAdult, який:

// Повертає true, якщо користувач старший або дорівнює 18 років, інакше — false.
// Задача 6: Оновлення віку
// Додайте до об'єкта user метод updateAge, який:

// Приймає число як аргумент.
// Збільшує значення властивості age на передане число.
// Задача 7: Зміна адреси
// Додайте до об'єкта user метод changeAddress, який:

// Приймає нову адресу (рядок) як аргумент.
// Оновлює значення властивості address.
// Задача 8: Перевірка вікової категорії
// Додайте до об'єкта user метод getCategory, який:

// Повертає одну з категорій залежно від віку:
// "дитина", якщо вік менший за 13 років,
// "підліток", якщо вік від 13 до 17 років,
// "дорослий", якщо вік 18 років або старший.
// Задача 9: Повне очищення даних
// Додайте до об'єкта user метод resetInfo, який:

// Скидає значення всіх властивостей (name, age, address) на пусті значення:
// name → пустий рядок,
// age → 0,
// address → пустий рядок.











// 2. Завдання: Об'єкт банківського рахунку
// Створи об'єкт із властивостями:

// bankName (рядок) — назва банку,
// accountNumber (число) — номер рахунку,
// balance (число) — поточний баланс.
// Додай методи:

// deposit, який приймає суму як аргумент і додає її до balance.
// withdraw, який приймає суму як аргумент і зменшує balance, якщо сума не перевищує поточний баланс. Метод повертає новий баланс.
// const object = {
//     bankName:"Monobank",
//     accountNumber: 123678,
//     balance: 400,
//     deposit(value){
// this.balance += value
//     },
// withdraw(value){
//     if(value < this.balance){
//         this.balance -= value
//     }
// }
// }

// object.deposit(1000);
// object.withdraw(500);
// console.log(object.balance);