// Задача-1
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2. В іншому випадку функція повинна повернути булеве значення false.

// function task1(str1, str2) {
//   const firstLetters = str1[0];
//   const lastLetters = str2[str2.length - 1];
//   if (firstLetters === lastLetters) {
//     return true;
//   } else return false;
// }

// console.log(task1('Hello world', 'World'));

// console.log(task1('MDHR','WDRM'));

// Задача-2
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює першій літері str2. В іншому випадку функція повинна повернути булеве значення false.

// function task2(str1, str2) {
//   const firstTaskOne = str1[0];
//   const lastTaskTwo = str2[0];

//   if (firstTaskOne === lastTaskTwo) {
//     return true;
//   } else {
//     return false;
//   }
// }

// console.log(task2('Daj', 'Daj'));

// console.log(task2('One', 'Daj'));


// Задача-3
// Напишіть функцію яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true якщо довжина str1 дорівнює довжині str2. В іншому випадку функція повинна повернути булеве значення false.

// function task3 (str1, str2 ){
//     const lastLettersOne = str1.length;
//     const lastLetterTwo = str2.length;

//     return lastLettersOne === lastLetterTwo
// } 
//  console.log(task3('Hello', 'Hello'));
 

// Задача-4
// Напишіть функцію яка приймає число num. Функція повинна повернути булеве значення true якщо кількість цифр у числі парна. В іншому випадку функція повинна повернути булеве значення false.


// function numberOne(num){

//     const numberTwo = num.toString().length;
// return (numberTwo %2) === 0
// }

// console.log(numberOne(12));

// Задача-5
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 більше, ніж num2. В іншому випадку функція повинна повернути булеве значення false.


// function numberOne(num1, num2){ 

//     return num1 > num2 
// }

// console.log(numberOne(3,4));


// Задача-6
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 ділиться на num2 без остачі. В іншому випадку функція повинна повернути булеве значення false.


// function numberTwo(num1,num2){
//     return num1%num2 === 0  
// }
// console.log(numberTwo(19,7));



// Задача-7
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є непарним числом. В іншому випадку функція повинна повернути булеве значення false.


// 

// Задача-8
// Напишіть функцію, яка приймає параметр str. Функція повинна повернути булеве значення true, якщо str містить принаймні одну велику літеру. В іншому випадку функція повинна повернути булеве значення false.
// Підказка: допоможе toLowerCase();

// function stringOne(str){
// return str !== str.toLowerCase()
// }

// console.log(stringOne('Hello'));


// Задача-9
// Напишіть функцію, яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true, якщо довжина str1 більше, ніж довжина str2. В іншому випадку функція повинна повернути булеве значення false.


// function stringOne(str1, str2) {
//     const stringOnne = str1.length;
//     const stringTwo = str2.length;

//     return stringOnne > stringTwo 
// }

// console.log(stringOne('Ok', 'Good'));

// Задача-12
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо str містить хоча б один пробіл. В іншому випадку функція повинна повернути булеве значення false.


// function stringOnne(str){
// return str.includes(' ')
// }

// console.log(stringOnne('Hello '));

//////////////////////////////////////////////////////////////////////////////////////////////////

// Задача-14
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо str є паліндромом (однаковий у зворотному напрямку). В іншому випадку функція повинна повернути булеве значення false.
// Підказка: тут допоможе метод масиву reverse();

// function stringOne(str){
//     return str.split('').reverse().join('') === str
// }
// console.log(stringOne('helleh'));


///////////////////////////////////////////////////////////////////////////////////////////


// Задача-15
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 менше або дорівнює num2. В іншому випадку функція повинна повернути булеве значення false.


//  function numberOne(num1, num2){
//     return num1 <= num2

//  } console.log(numberOne( 17, 15));
 
//////////////////////////////////////////////////////


// Задача-17
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо перша літера str є голосною (a, e, i, o, u). В іншому випадку функція повинна повернути булеве значення false.


// function isFirstLetter(str){
//     const firstLetters = str[0].toLowerCase();
// return 'aeiou'.includes(firstLetters);


// }   console.log(isFirstLetter('Hello'));

//////////////////////////////////////////////////////////////////////////

// Задача-19
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 і num2 рівні. В іншому випадку функція повинна повернути булеве значення false.



// function evenNumbers(num1, num2){



//     return num1 === num2;
// }

// console.log(evenNumbers(25, 45));

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача-20
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num більше або дорівнює нулю. В іншому випадку функція повинна повернути булеве значення false.




// function  oneNumber (num){


//     return num >=0;
// }
//  console.log(oneNumber(-1));
 
///////////////////////////////////////////////////////////////////////////////////////////////////////////


// Задача-21
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо довжина str є парною. В іншому випадку функція повинна повернути булеве значення false.


// function stringLengthEven(str){


//     return str.length % 2 === 0;
// }
// console.log(stringLengthEven('Apple'));


//////////////////////////////////////////////////////////////////////////////////////////////////
// Задача-22
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо num1 ділиться на 2, а num2 не ділиться на 2. В іншому випадку функція повинна повернути булеве значення false.


// function checkNumbers(num1, num2){

//     return num1 % 2 === 0 && num2  %2 !== 0;

// } console.log(checkNumbers(12, 12));


//////////////////////////////////////////////////////////////////////////////////////////////////////////


// Задача-23
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num більше 100, але менше 200. В іншому випадку функція повинна повернути булеве значення false.

// function anyNumber(num){
    
//     return num > 100 && num < 200;
// }
// console.log(anyNumber(111));

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача-24
// Напишіть функцію, яка приймає рядок str. Функція повинна повернути булеве значення true, якщо str містить лише маленькі літери. В іншому випадку функція повинна повернути булеве значення false.
// Підказка: допоможе toLowerCase();


// function acceptsString(str){

//     return str === str.toLowerCase()
// }

// console.log(acceptsString('Good'));


//////////////////////////////////////////////////////////////////////////////////////////////////
// Задача-25
// Напишіть функцію, яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true, якщо str1 є частиною str2. В іншому випадку функція повинна повернути булеве значення false.

// function acceptsString(str1, str2){


//     return str2.includes(str1);
// }

// console.log(acceptsString('hello', 'helloWorld'));


///////////////////////////////////////////////////////////////////////////////////////////////
// Задача-26
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є негативним числом. В іншому випадку функція повинна повернути булеве значення false.


// function acceptsNumber(num){
//     return num < 0;
// }

// console.log(acceptsNumber(23));

///////////////////////////////////////////////////////////////////////////////////////////////////

// Задача-27
// Напишіть функцію, яка приймає два параметри num1 та num2. Функція повинна повернути булеве значення true, якщо різниця між num1 та num2 більше 50. В іншому випадку функція повинна повернути булеве значення false.


// function numberTwo(num1, num2){
//     return num1-num2 > 50;

// } console.log(numberTwo(100, 40));

//////////////////////////////////////////////////////////////////////////////

// Задача-28
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є нуль. В іншому випадку функція повинна повернути булеве значення false.


//  function getNumber(num){
//     return num === 0;

//  } console.log(getNumber(3));
 
/////////////////////////////////////////////////////////////////////////////////////////////////////


// Задача-29
// Напишіть функцію, яка приймає два параметри str1 та str2. Функція повинна повернути булеве значення true, якщо остання літера str1 є голосною (a, e, i, o, u). В іншому випадку функція повинна повернути булеве значення false.




// function lastLetters(str1, str2){
//     const checkLastLetters = str1[str1.length-1].toLowerCase();


// return 'aeiou'.includes(checkLastLetters);
// } 

// console.log(lastLetters('hello'));



//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача-30
// Напишіть функцію, яка приймає число num. Функція повинна повернути булеве значення true, якщо num є кратним 10. В іншому випадку функція повинна повернути булеве значення false.

// function getNumber(num){
// return num % 10 === 0;

// } 
// console.log(getNumber(22));



//////////////////////////////////////////////////////////////////////////////////////////////////


// Task 2
// Яким буде результат виразів?

console.log(5 > 4);  // true

console.log(10 >= '7'); // true

console.log('2' > '12'); // true !

console.log('2' < '12'); // false !

console.log('4' == 4); // true !

console.log('6' === 6); // false

console.log('false' === false); // false

console.log(1 == true); // true

console.log(1 === true); // false

console.log('0' == false); // true!

console.log('0' === false); // false

console.log('Papaya' < 'papaya'); // true !

console.log('Papaya' === 'papaya');// false

console.log(undefined == null); // true 

console.log(undefined === null); // false


///////////////////////////////////////////////////////////////



// Task 1
// Напиши скрипт, який виводить у консоль заокруглені вгору/вниз і т.д. значення змінної value. Використовуй методи Math.floor(), Math.ceil() та Math.round(). Перевір що буде в консолі при значеннях 27.3 та 27.9.




const value = 27.5;
console.log(Math.floor(value));
console.log(Math);




const value1 = 27.3;
console.log(Math.floor(value1));  
console.log(Math.ceil(value1));
console.log(Math.round(value1));


const value2 = 27.9;
console.log( Math.floor(value2));
console.log(Math.ceil(value2));
console.log(Math.round(value2)); 
