// 1. Створіть змінну з ім'ям `name` і присвойте їй ваше ім'я. Виведіть це ім'я в
//    консоль.

// 1. Створіть змінну `age` і присвойте їй ваш вік. Виведіть в консоль рядок, що
//    містить ваш вік у такому форматі: "Мені {вік} років".

// 1. Створіть змінні `x` і `y` і присвойте їм довільні числа. Виведіть в консоль
//    результати додавання, віднімання, множення та ділення цих чисел.

// 1. Створіть змінну `city` і присвойте їй назву вашого міста. Створіть рядок,
//    який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

// 1. Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб
//    витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в
//    консоль.

// 1. Створіть змінну `price` і присвойте їй число. Створіть рядок, що містить ціну
//    з символом гривні, наприклад: "Ціна: 500 грн".

// ---
// // 


const name = Myroslava;

console.log(name)